rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 12:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgab1a19a">1. philosophy</a></li>
<li><a href="#orgd487a2d">2. book https://rust-book.cs.brown.edu/</a></li>
<li><a href="#orgbdee48a">3. book: Zero To Production In Rust</a></li>
<li><a href="#org6dcf0a9">4. cargo - package manager</a>
<ul>
<li><a href="#orgedfd688">4.1. terms</a></li>
<li><a href="#org5e37a02">4.2. install package:</a></li>
<li><a href="#org0ea2a93">4.3. dependencies in Cargo.toml</a></li>
<li><a href="#orgd1f95d4">4.4. cargo build - feature selection</a></li>
<li><a href="#org5698b9e">4.5. flags</a></li>
<li><a href="#orgd54dc1c">4.6. HOWTO disable default in dependencies of dependencies</a></li>
</ul>
</li>
<li><a href="#org46f47a4">5. Hello world</a></li>
</ul>
</div>
</div>
<p>
; -<b>- mode: Org ; fill-column: 110; eval: (hidepw-mode 1) -</b>-
</p>
<ul class="org-ul">
<li><a href="https://www.rust-lang.org/">https://www.rust-lang.org/</a></li>
<li>STD lib <a href="https://doc.rust-lang.org/std/">https://doc.rust-lang.org/std/</a></li>
<li>Environment Variables	<a href="https://doc.rust-lang.org/cargo/reference/environment-variables.html">https://doc.rust-lang.org/cargo/reference/environment-variables.html</a></li>
<li>The Cargo Book		<a href="https://doc.rust-lang.org/cargo/index.html">https://doc.rust-lang.org/cargo/index.html</a></li>
<li>The rustc Book		<a href="https://doc.rust-lang.org/rustc/what-is-rustc.html">https://doc.rust-lang.org/rustc/what-is-rustc.html</a></li>
<li>Codegen Options		<a href="https://doc.rust-lang.org/rustc/codegen-options/index.html">https://doc.rust-lang.org/rustc/codegen-options/index.html</a></li>
</ul>
<div id="outline-container-orgab1a19a" class="outline-2">
<h2 id="orgab1a19a"><span class="section-number-2">1.</span> philosophy</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://gist.github.com/DarinM223/e7237114cfdcf3644f90">https://gist.github.com/DarinM223/e7237114cfdcf3644f90</a>
</p>

<ul class="org-ul">
<li>Ownership (only one variable "owns" the data at one time, and the owner is in charge of deallocating)</li>
<li>Borrowing (you can borrow a reference to an owned variable)</li>
<li>Lifetimes (all data keeps track of when it will be destroyed)</li>
</ul>
<p>
<b>features</b>
</p>
<ul class="org-ul">
<li>all references point to valid memory. No garbage collector.</li>
<li>"borrow checker" tracks the object lifetime of all references in a program during compiling.</li>
<li>OOP: structs, enums, traits, and methods</li>
<li>fun. pr-ming: immutability, pure functions, higher order functions, and pattern matching.</li>
</ul>
<p>
<b>Ideas</b>
</p>
<ul class="org-ul">
<li>immutability</li>
<li>higher-order functions - functions is a first citizen (in arguments and as return value)</li>
<li>algebraic data types - tuples and records, enumes</li>
</ul>
</div>
</div>
<div id="outline-container-orgd487a2d" class="outline-2">
<h2 id="orgd487a2d"><span class="section-number-2">2.</span> book <a href="https://rust-book.cs.brown.edu/">https://rust-book.cs.brown.edu/</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://doc.rust-lang.org/stable/book/">https://doc.rust-lang.org/stable/book/</a>
</p>
</div>
</div>

<div id="outline-container-orgbdee48a" class="outline-2">
<h2 id="orgbdee48a"><span class="section-number-2">3.</span> book: Zero To Production In Rust</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>www.zero2prod.com</li>
<li><a href="https://www.zero2prod.com/assets/sample_zero2prod.pdf">https://www.zero2prod.com/assets/sample_zero2prod.pdf</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6dcf0a9" class="outline-2">
<h2 id="org6dcf0a9"><span class="section-number-2">4.</span> cargo - package manager</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgedfd688" class="outline-3">
<h3 id="orgedfd688"><span class="section-number-3">4.1.</span> terms</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>crate</b> - is the smallest unit of code that the compiler considers at a time.
</p>
<ul class="org-ul">
<li><b>crate</b> is a library or executable program (rustc)</li>
<li>type of the crates: binary or library.</li>
<li>can be a single source file or a collection of files and modules.</li>
<li>Loosely, the term “crate” may refer to either the source code of the target or to the compiled artifact that
the target produces. It may also refer to a compressed package fetched from a registry.</li>
<li>typically <b>root</b> -  a source file that defines the root module of the crate
<ul class="org-ul">
<li>for binary:  <code>src/main.rs</code></li>
<li>for library: <code>src/lib.rs</code></li>
</ul></li>
</ul>

<p>
<b>package</b> - A package is a collection of source files and a Cargo.toml manifest file and Cargo.lock.
</p>
<ul class="org-ul">
<li>contains multiple targets, each of which is a “crate”.</li>
<li>Cargo.toml - dependencies and desired versions</li>
<li>Cargo.lock - record actual versions</li>
</ul>

<p>
steps:
</p>
<ol class="org-ol">
<li>get package, ex. <code>git clone https://github.com/rust-lang/regex.git</code></li>
<li>build and download dependencies with cargo: <code>cargo build</code>
<ul class="org-ul">
<li>fetch the new dependencies and all of their dependencies, compile them all, and update the Cargo.lock</li>
</ul></li>
</ol>

<p>
<b>crates.io</b> is the Rust community’s central package registry.
</p>
</div>
</div>

<div id="outline-container-org5e37a02" class="outline-3">
<h3 id="org5e37a02"><span class="section-number-3">4.2.</span> install package:</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
cargo install some-package
</pre>

<ul class="org-ul">
<li>create ~/.cargo/ folder</li>
</ul>
</div>
</div>
<div id="outline-container-org0ea2a93" class="outline-3">
<h3 id="org0ea2a93"><span class="section-number-3">4.3.</span> dependencies in Cargo.toml</h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example">
[dependencies]
foo = { version = "1.0", optional = true }
[build-dependencies]
bar = { version = "1.0", optional = true }
[target."...".dependencies]
[target.'cfg(windows)'.dependencies]
[target.'cfg(target_arch = "x86_64")'.dependencies]
</pre>
</div>
</div>
<div id="outline-container-orgd1f95d4" class="outline-3">
<h3 id="orgd1f95d4"><span class="section-number-3">4.4.</span> cargo build - feature selection</h3>
<div class="outline-text-3" id="text-4-4">
<p>
&#x2013;bin &lt;binfile&gt; build only specified target binary.
</p>

<p>
features in Cargo.toml - is optional dependencies
</p>

<p>
ex. Cargo.toml
</p>
<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #92a65e; font-weight: bold;">dependencies</span>]
<span style="color: #cae682;">indoc</span> = { version = <span style="color: #95e454;">"2.0.1"</span>, optional = true }
<span style="color: #cae682;">chrono-tz</span> = { version = <span style="color: #95e454;">"&gt;= 0.6, &lt; 0.10"</span>, default-features = false, optional = true }

[<span style="color: #92a65e; font-weight: bold;">features</span>]
<span style="color: #cae682;">default</span> = [<span style="color: #95e454;">"feature1"</span>, <span style="color: #95e454;">"feature2"</span>]
<span style="color: #cae682;">macros</span> = [<span style="color: #95e454;">"pyo3-macros"</span>, <span style="color: #95e454;">"indoc"</span>, <span style="color: #95e454;">"unindent"</span>]
</pre>
</div>

<p>
"indoc" - can be a dependency or another feature
</p>

<p>
<b>Default features</b> are a convenience that make it easier to use a package without forcing the user to
 carefully select which features to enable for common use, but there are some drawbacks. Dependencies
 automatically enable default features unless default-features = false is specified. This can make it
 difficult to ensure that the default features are not enabled, especially for a dependency that appears
 multiple times in the dependency graph. Every package must ensure that default-features = false is specified
 to avoid enabling them.
</p>


<p>
&#x2013;no-default-features - disable build default features for selected packages
</p>

<p>
Global Disable Not Supported: As of now, Cargo does not support a global option to disable default features
 for all dependencies simultaneously. You must specify this option for each dependency individually.
</p>
<ul class="org-ul">
<li>workaround is to modify Cargo.toml per-dependency, specify the <code>default-features = false</code> option.</li>
</ul>



<p>
<a href="https://doc.rust-lang.org/cargo/reference/features.html#command-line-feature-options">https://doc.rust-lang.org/cargo/reference/features.html#command-line-feature-options</a>
</p>
</div>
</div>
<div id="outline-container-org5698b9e" class="outline-3">
<h3 id="org5698b9e"><span class="section-number-3">4.5.</span> flags</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<a href="https://doc.rust-lang.org/cargo/reference/config.html#buildrustflags">https://doc.rust-lang.org/cargo/reference/config.html#buildrustflags</a>
</p>
</div>
</div>
<div id="outline-container-orgd54dc1c" class="outline-3">
<h3 id="orgd54dc1c"><span class="section-number-3">4.6.</span> HOWTO disable default in dependencies of dependencies</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8ac6f2; font-weight: bold;">for</span> f<span style="color: #8ac6f2; font-weight: bold;"> in</span> /tmp/gentoo/* ; <span style="color: #8ac6f2; font-weight: bold;">do</span>
    cat sed -i -z -E <span style="color: #95e454;">'s/default = \[[^]]*\]/default = \[\]/g'</span> <span style="color: #95e454;">"$f"</span>/Cargo.toml
<span style="color: #8ac6f2; font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8ac6f2; font-weight: bold;">for</span> f<span style="color: #8ac6f2; font-weight: bold;"> in</span> /tmp/gentoo/* ; <span style="color: #8ac6f2; font-weight: bold;">do</span>
    cat $<span style="color: #cae682;">f</span>/Cargo.toml | sed -z -E <span style="color: #95e454;">'s/default = \[[^]]*\]/default = \[\]/g'</span> | grep <span style="color: #95e454;">'default ='</span>
<span style="color: #8ac6f2; font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">for f in /tmp/gentoo/serde-1.0.197 ; do</span>
cat /tmp/gentoo/serde-1.0.197/Cargo.toml | sed -z -E <span style="color: #95e454;">'s/default = \[[^]]*\]/default = \[\]/g'</span>
<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">done</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org46f47a4" class="outline-2">
<h2 id="org46f47a4"><span class="section-number-2">5.</span> Hello world</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-rust">fn main() {
    println!("Hello, World!");
}
</pre>
</div>

<pre class="example">
rustc main.rs
./main
</pre>



<p>
println! calls a Rust macro.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-14 Tue 12:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
